app/Controllers/Home.php

    public function cek()
    {

        $nama = $this->request->getPost('nama');
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');
        $hashedPassword = password_hash($password, PASSWORD_DEFAULT);
        var_dump($nama,$email,$password,$hashedPassword);
        $userModel = new UserModel();
        $user = $userModel->where('nama', $nama)->first();
---
SELECT *
FROM `users`
WHERE `nama` = 'rakev2'
 LIMIT 1

    public function registerSubmit()
    {

        $nama = $this->request->getPost('nama');
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');
        $hashedPassword = password_hash($password, PASSWORD_DEFAULT);

        $userModel = new UserModel();
        $data = [
            'nama' => $nama,
            'email' => $email,
            'password' => $hashedPassword,
        ];
        $userModel->insert($data);
---
INSERT INTO `users` (`nama`, `email`, `password`) VALUES ('rakev', 'rakev@gmail.com', '$2y$10$3JMsDpS7jxuLUwxEc8CAVuSRmrmOxcZmzQbTdFnSoxGN5wjozUdIC')